OpenFOAM-2.3.0/tutorials/combustion/fireFoam/les/smallPoolFire3D/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    outlet
    {

        type            inletOutlet;
        inletValue      uniform (0 0 0);
        value           uniform (0 0 0);

    }
    sides
    {
        type            pressureInletOutletVelocity;
        value           uniform (0 0 0);
        phi             phi;
    }
    base
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    inlet
    {
        type            fixedValue;
        value           uniform (0 0.01 0);
    }

}


// ************************************************************************* //
